In [2]:
import pandas as pd

In [3]:
# Creating a sample dataset
data = {
    'Name': ['John', 'Jane', 'Bob', 'Alice', 'Eve', 'Charlie', 'David', 'Frank', 'Grace', 'Helen'],
    'Subject': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 78, 92, 88, 75, 80, 98, 79, 88, 90]
}

df = pd.DataFrame(data)

In [4]:
df

      Name  Subject  Score
0     John     Math     85
1     Jane  Science     78
2      Bob     Math     92
3    Alice  Science     88
4      Eve     Math     75
5  Charlie  Science     80
6    David     Math     98
7    Frank  Science     79
8    Grace     Math     88
9    Helen  Science     90

### Aggregation = taking a bunch of values and summarizing them into a single value.
'mean','sum','max','min','count'

## To find the mean() score based on particular subject
## We use groupby() method of pandas

In [5]:
average_score=df.groupby('Subject')['Score'].mean()

In [6]:
average_score

Subject
Math       87.6
Science    83.0
Name: Score, dtype: float64

In [7]:
average_score[0] # this wont be used in future

C:\Users\user\AppData\Local\Temp\ipykernel_16452\3461428594.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  average_score[0] # this wont be used in future

87.6

## Finding max and min of scores

In [8]:
max=df.groupby('Subject')['Score'].max()

In [9]:
max

Subject
Math       98
Science    90
Name: Score, dtype: int64

In [10]:
min=df.groupby('Subject')['Score'].min()

In [11]:
min

Subject
Math       75
Science    78
Name: Score, dtype: int64

## Count scores in particular subject

In [12]:
count=df.groupby('Subject')['Score'].count()

In [13]:
count

Subject
Math       5
Science    5
Name: Score, dtype: int64

## Find total scores of each subject

In [14]:
sum=df.groupby('Subject')['Score'].sum()

In [15]:
sum

Subject
Math       438
Science    415
Name: Score, dtype: int64

## Performing multiple Aggregations

In [16]:
agg_results=df.groupby('Subject')['Score'].agg(['mean','sum','max','min','count'])

In [17]:
agg_results

         mean  sum  max  min  count
Subject
Math     87.6  438   98   75      5
Science  83.0  415   90   78      5

In [18]:
df.groupby("Subject").agg({'Score':'mean'})

         Score
Subject
Math      87.6
Science   83.0

In [23]:
df.groupby('Subject')['Score'].agg(
                          average='mean',
                          add='sum')

         average  add
Subject
Math        87.6  438
Science     83.0  415

## Performing Different aggregation for different column

In [27]:
mydata = {"name": ["Ram", "Shyam", "Ram"],
          "a":[1, 2, 3],
          "b" : [4, 5, 6],
          "c":[7, 8, 9]}
tempdf = pd.DataFrame(mydata)
tempdf

    name  a  b  c
0    Ram  1  4  7
1  Shyam  2  5  8
2    Ram  3  6  9

In [90]:
tempdf.groupby("name").agg({'a':'mean','b':'max'})

         a  b
name
Ram    2.0  6
Shyam  2.0  5

## Filtering

In [1]:
import pandas as pd

# Sample data with Nepali names in English
data = {
    'First Name': ['Ram', 'Sita', 'Gopal', 'Alok', 'Maya', 'Rajani', 'Abhishek', 'Shivani', 'Priyanka', 'Sunita', 
                   'Dipesh', 'Sangeeta', 'Niraj', 'Raju', 'Suman', 'Shivani', 'Ayush', 'Manoj', 'Pradeep', 'Anita'],
    'Last Name': ['Shrestha', 'Gurung', 'Bahadur', 'Pokhrel', 'Shrestha', 'Thapa', 'Gurung', 'Pokhrel', 'Shrestha', 
                  'Thapa', 'Gurung', 'Shrestha', 'Thapa', 'Gurung', 'Shrestha', 'Thapa', 'Gurung', 'Shrestha', 
                  'Thapa', 'Gurung'],
    'Age': [25, 30, 35, 40, 28, 32, 27, 31, 33, 29, 34, 26, 38, 36, 37, 39, 42, 41, 45, 43],
    'Address': ['Kathmandu', 'Pokhara', 'Lalitpur', 'Bhaktapur', 'Chitwan', 'Dharan', 'Butwal', 'Nepalgunj', 
                'Birgunj', 'Hetauda', 'Dhangadi', 'Biratnagar', 'Itahari', 'Damak', 'Bharatpur', 'Janakpur', 
                'Bhimeshwar', 'Ghorahi', 'Birgunj', 'Bhaktapur'],
    'Salary': [50000, 60000, 55000, 70000, 48000, 52000, 56000, 58000, 65000, 54000, 59000, 51000, 72000, 68000, 
               71000, 69000, 75000, 74000, 80000, 77000],
    'Department': ['IT', 'HR', 'Finance', 'Marketing', 'IT', 'HR', 'Finance', 'Marketing', 'IT', 'HR', 
                   'Finance', 'Marketing', 'IT', 'HR', 'Finance', 'Marketing', 'IT', 'HR', 'Finance', 'Marketing']
}

df = pd.DataFrame(data)

In [2]:
df

   First Name Last Name  Age     Address  Salary Department
0         Ram  Shrestha   25   Kathmandu   50000         IT
1        Sita    Gurung   30     Pokhara   60000         HR
2       Gopal   Bahadur   35    Lalitpur   55000    Finance
3        Alok   Pokhrel   40   Bhaktapur   70000  Marketing
4        Maya  Shrestha   28     Chitwan   48000         IT
5      Rajani     Thapa   32      Dharan   52000         HR
6    Abhishek    Gurung   27      Butwal   56000    Finance
7     Shivani   Pokhrel   31   Nepalgunj   58000  Marketing
8    Priyanka  Shrestha   33     Birgunj   65000         IT
9      Sunita     Thapa   29     Hetauda   54000         HR
10     Dipesh    Gurung   34    Dhangadi   59000    Finance
11   Sangeeta  Shrestha   26  Biratnagar   51000  Marketing
12      Niraj     Thapa   38     Itahari   72000         IT
13       Raju    Gurung   36       Damak   68000         HR
14      Suman  Shrestha   37   Bharatpur   71000    Finance
15    Shivani     Thapa   39    Janakpur   69000  Marketing
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
17      Manoj  Shrestha   41     Ghorahi   74000         HR
18    Pradeep     Thapa   45     Birgunj   80000    Finance
19      Anita    Gurung   43   Bhaktapur   77000  Marketing

In [3]:
df.groupby('Department').agg({'Age':["min",'max'],'Salary':'mean'})

           Age       Salary
           min max     mean
Department
Finance     27  45  64200.0
HR          29  41  61600.0
IT          25  42  62000.0
Marketing   26  43  65000.0

In [4]:
df['Address'].value_counts()

Address
Bhaktapur     2
Birgunj       2
Kathmandu     1
Dhangadi      1
Bhimeshwar    1
Janakpur      1
Bharatpur     1
Damak         1
Itahari       1
Biratnagar    1
Hetauda       1
Pokhara       1
Nepalgunj     1
Butwal        1
Dharan        1
Chitwan       1
Lalitpur      1
Ghorahi       1
Name: count, dtype: int64

filter based age

### Filter based on age

In [5]:
df['Age']>30

0     False
1     False
2      True
3      True
4     False
5      True
6     False
7      True
8      True
9     False
10     True
11    False
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
Name: Age, dtype: bool

In [6]:
df[df['Age']>30] # gives row which are only true

   First Name Last Name  Age     Address  Salary Department
2       Gopal   Bahadur   35    Lalitpur   55000    Finance
3        Alok   Pokhrel   40   Bhaktapur   70000  Marketing
5      Rajani     Thapa   32      Dharan   52000         HR
7     Shivani   Pokhrel   31   Nepalgunj   58000  Marketing
8    Priyanka  Shrestha   33     Birgunj   65000         IT
10     Dipesh    Gurung   34    Dhangadi   59000    Finance
12      Niraj     Thapa   38     Itahari   72000         IT
13       Raju    Gurung   36       Damak   68000         HR
14      Suman  Shrestha   37   Bharatpur   71000    Finance
15    Shivani     Thapa   39    Janakpur   69000  Marketing
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
17      Manoj  Shrestha   41     Ghorahi   74000         HR
18    Pradeep     Thapa   45     Birgunj   80000    Finance
19      Anita    Gurung   43   Bhaktapur   77000  Marketing

In [7]:
age_filter=(df['Age']>30)

In [8]:
age_filter

0     False
1     False
2      True
3      True
4     False
5      True
6     False
7      True
8      True
9     False
10     True
11    False
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
Name: Age, dtype: bool

In [9]:
df[age_filter]

   First Name Last Name  Age     Address  Salary Department
2       Gopal   Bahadur   35    Lalitpur   55000    Finance
3        Alok   Pokhrel   40   Bhaktapur   70000  Marketing
5      Rajani     Thapa   32      Dharan   52000         HR
7     Shivani   Pokhrel   31   Nepalgunj   58000  Marketing
8    Priyanka  Shrestha   33     Birgunj   65000         IT
10     Dipesh    Gurung   34    Dhangadi   59000    Finance
12      Niraj     Thapa   38     Itahari   72000         IT
13       Raju    Gurung   36       Damak   68000         HR
14      Suman  Shrestha   37   Bharatpur   71000    Finance
15    Shivani     Thapa   39    Janakpur   69000  Marketing
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
17      Manoj  Shrestha   41     Ghorahi   74000         HR
18    Pradeep     Thapa   45     Birgunj   80000    Finance
19      Anita    Gurung   43   Bhaktapur   77000  Marketing

### Filter row where salary is greater than 60000 and department is IT

In [10]:
filtered_df = df[(df['Salary'] > 60000) & (df['Department'] == 'IT')]

In [67]:
filtered_df

   First Name Last Name  Age     Address  Salary Department
8    Priyanka  Shrestha   33     Birgunj   65000         IT
12      Niraj     Thapa   38     Itahari   72000         IT
16      Ayush    Gurung   42  Bhimeshwar   75000         IT

### Filter row where department is IT or finance

In [72]:
df[(df['Department']=='IT') | (df['Department']=='Finance')]

   First Name Last Name  Age     Address  Salary Department
0         Ram  Shrestha   25   Kathmandu   50000         IT
2       Gopal   Bahadur   35    Lalitpur   55000    Finance
4        Maya  Shrestha   28     Chitwan   48000         IT
6    Abhishek    Gurung   27      Butwal   56000    Finance
8    Priyanka  Shrestha   33     Birgunj   65000         IT
10     Dipesh    Gurung   34    Dhangadi   59000    Finance
12      Niraj     Thapa   38     Itahari   72000         IT
14      Suman  Shrestha   37   Bharatpur   71000    Finance
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
18    Pradeep     Thapa   45     Birgunj   80000    Finance

In [15]:
# another method isin
df['Department'].isin(['IT','Finance'])

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12     True
13    False
14     True
15    False
16     True
17    False
18     True
19    False
Name: Department, dtype: bool

In [16]:

df[df['Department'].isin(['Finance','IT'])]

   First Name Last Name  Age     Address  Salary Department
0         Ram  Shrestha   25   Kathmandu   50000         IT
2       Gopal   Bahadur   35    Lalitpur   55000    Finance
4        Maya  Shrestha   28     Chitwan   48000         IT
6    Abhishek    Gurung   27      Butwal   56000    Finance
8    Priyanka  Shrestha   33     Birgunj   65000         IT
10     Dipesh    Gurung   34    Dhangadi   59000    Finance
12      Niraj     Thapa   38     Itahari   72000         IT
14      Suman  Shrestha   37   Bharatpur   71000    Finance
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
18    Pradeep     Thapa   45     Birgunj   80000    Finance

### Filter row where  age is greater than 40 and department is IT or finance

In [79]:
df[(df['Age']>40) & df['Department'].isin(['IT','Finance'])]

   First Name Last Name  Age     Address  Salary Department
16      Ayush    Gurung   42  Bhimeshwar   75000         IT
18    Pradeep     Thapa   45     Birgunj   80000    Finance